from src.cards import card_number_reader, expenses_sum, cashback
from src.file_reader import excel_reader


def test_card_number_reader():
    card_number_reader({'Дата операции': '04.01.2018 14:05:08', 'Дата платежа': '06.01.2018',
                        'Номер карты': '*7197', 'Статус': 'OK', 'Сумма операции': -1065.9,
                        'Валюта операции': 'RUB', 'Сумма платежа': -1065.9, 'Валюта платежа': 'RUB',
                        'Кэшбэк': 'nan', 'Категория': 'Супермаркеты', 'MCC': 5411.0, 'Описание': 'Пятёрочка',
                        'Бонусы (включая кэшбэк)': 21, 'Округление на инвесткопилку': 0,
                        'Сумма операции с округлением': 1065.9})
    assert '*7197'


def test_expenses_sum():
    expenses_sum(excel_reader("operations.xlsx"))
    assert 27774243135.545387


def test_cashback():
    cashback([{'Дата операции': '04.01.2018 14:05:08', 'Дата платежа': '06.01.2018',
                        'Номер карты': '*7197', 'Статус': 'OK', 'Сумма операции': -1065.9,
                        'Валюта операции': 'RUB', 'Сумма платежа': -1065.9, 'Валюта платежа': 'RUB',
                        'Кэшбэк': 'nan', 'Категория': 'Супермаркеты', 'MCC': 5411.0, 'Описание': 'Пятёрочка',
                        'Бонусы (включая кэшбэк)': 21, 'Округление на инвесткопилку': 0,
                        'Сумма операции с округлением': 1065.9}])
    assert 11